test/performance/health.yml
config:
  target: 'http://localhost:8888'
  phases:
    - duration: 4
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 5
      arrivalRate: 5
      rampTo: 10
      name: Ramp up load
    - duration: 10
      arrivalRate: 10
      rampTo: 30
      name: Spike phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}

scenarios:
  - name: 'Get app health'
    flow:
      - get:
          url: '/api/liquidator/health/'
          expect:
            - statusCode: 200